/************************************************************************************
		KevbinX 北辰青菁
*************************************************************************************
程序功能：学习按位异或运算符"^"和逻辑或运算符"||"控制LED的点亮
************************************************************************************/
#include<reg52.h> // 包含reg52.h头文件，用于引入单片机寄存器的定义

#define u8 unsigned char // 定义宏，将unsigned char类型重命名为u8

sbit P10=P1^0; // 定义P10??P1的第0位
sbit P11=P1^1; // 定义P11为P1的第1位
sbit P12=P1^2; // 定义P12为P1的第2位
sbit P13=P1^3; // 定义P13为P1的第3位
sbit P17=P1^7; // 定义P17为P1的第7位

void main()
{
	u8 a,b,c,d; // 定义4个无符号字符型变量a, b, c, d
	
	a = 5; // 将变量a赋值为5，即二进制0101
	b = 5; // 将变量b赋值为5，即二进制0101
	c = 3; // 将变量c赋值为3，即二进制0011
	d = 6; // 将变量d赋值为6，即二进制0110
	
	if((a^b)||(c^d)) // 判断a异或b的结果或c异或d的结果是否为真
	{//(0101^0101)||(0011^0110)=(0000)||(0101)=1;
		P13 = 0; // 如果条件成立，将P13置为低电平
	}
	else
	{
		P17 = 0; // 如果条件不成立，将P17置为低电平
	}
}
